# Примеры маршрутов для тестирования
ROUTE_EXAMPLES = {
    "1": {
        "name": "Москва: Красная площадь → МГУ",
        "start": "55.7539,37.6208",
        "end": "55.7033,37.5307"
    },
    "2": {
        "name": "Москва: ВДНХ → Парк Горького", 
        "start": "55.8219,37.6311",
        "end": "55.7317,37.6033"
    },
    "3": {
        "name": "Санкт-Петербург: Эрмитаж → Петропавловская крепость",
        "start": "59.9398,30.3146", 
        "end": "59.9500,30.3167"
    },
    "4": {
        "name": "Москва - Питер",
        "start": "55.703946,37.644581", 
        "end": "59.938369,30.312683"
    }
}

OSRM_CONFIG = {
    'url': "http://router.project-osrm.org/route/v1/driving",
    'params': {
        'overview': 'full',
        'geometries': 'polyline', 
        'steps': 'false'
    }
}